app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
---
<ul class="list-group">
<% if @question.answer.count == 0 then %>