app/controllers/answers_controller.rb

INSERT INTO "answers" ("question_id", "content", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 1], ["content", "そんなものはない。"], ["name", "Zoro"], ["created_at", "2022-05-09 04:10:48.705463"], ["updated_at", "2022-05-09 04:10:48.705463"]]
SELECT COUNT(*) FROM "answers" WHERE (question_id = 1)
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "finished" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["finished", 1], ["updated_at", "2022-05-09 04:20:39.167339"], ["id", 1]]
---
  def create
    end_counter = 10
    @answer = Answer.new(answer_params)

    respond_to do |format|
      if @answer.save
        num = Answer.where('question_id = ?', @answer.question_id).count
        if num >= end_counter then
          q = Question.find @answer.question_id
          q.finished = true
          q.save