app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @card = Card.find(params[:id])

INSERT INTO "cards" ("title", "author", "price", "publisher", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "おばけ太郎"], ["author", "saki"], ["price", 100], ["publisher", "kd社"], ["memo", "Good Story"], ["created_at", "2022-04-21 08:20:23.349807"], ["updated_at", "2022-04-21 08:20:23.349807"]]
---
  def add
    if request.post? then
      Card.create(card_params)

SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @card = Card.find(params[:id])

DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def delete
    Card.find(params[:id]).destroy