app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
    @msg = 'Message data.'
    @data = Message.all

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @msg = 'Index data.'
    @message = Message.find(params[:id])

INSERT INTO "messages" ("person_id", "title", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["person_id", 5], ["title", "閻魔と覇王色"], ["message", "名刀閻魔の使い方を解説。"], ["created_at", "2022-04-23 04:26:53.223194"], ["updated_at", "2022-04-23 04:26:53.223194"]]
---
  def create
    @message = Message.new message_params
    if @message.save then