app/controllers/questions_controller.rb

  def index
    @questions = Question.all.order created_at: :desc
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "content", "name", "finished", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "カイドウの倒し方"], ["content", "カイドウはどうやったら倒せるのですか？"], ["name", "Momonosuke"], ["finished", 0], ["created_at", "2022-05-09 03:57:22.417304"], ["updated_at", "2022-05-09 03:57:22.417304"]]